astb_relise/src/DataProcessors/СозданиеНормВыдачиСИЗ/СозданиеНормВыдачиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СозданиеНормВыдачиСИЗ</name>
  <attributes>
    <name>Организация</name>
    <comment>Организация или ТОН</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьШтатноеРасписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсходныеНормыТаблица</name>
    <attributes>
      <name>Переносить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВыдачиСИЗ</name>
      <type>
        <types>EnumRef.ВидыВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ГОСТ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиИПрофессии</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаВыдачи</name>
      <type>
        <types>CatalogRef.НормыВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеНормы</name>
      <type>
        <types>CatalogRef.ПунктыТОН</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьВыдачи</name>
      <type>
        <types>CatalogRef.ПериодичностьВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаАСТБ</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеНормы</name>
      <type>
        <types>CatalogRef.УсловияНорм</types>
      </type>
    </attributes>
    <attributes>
      <name>УточненноеОснованиеНормы</name>
      <type>
        <types>CatalogRef.ПунктыТОН</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦелевыеНормыТаблица</name>
    <attributes>
      <name>ВидВыдачиСИЗ</name>
      <type>
        <types>EnumRef.ВидыВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ГОСТ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиИПрофессии</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаВыдачи</name>
      <type>
        <types>CatalogRef.НормыВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеНормы</name>
      <type>
        <types>CatalogRef.ПунктыТОН</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьВыдачи</name>
      <type>
        <types>CatalogRef.ПериодичностьВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаАСТБ</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеНормы</name>
      <type>
        <types>CatalogRef.УсловияНорм</types>
      </type>
    </attributes>
    <attributes>
      <name>УточненноеОснованиеНормы</name>
      <type>
        <types>CatalogRef.ПунктыТОН</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

astb_relise/src/InformationRegisters/ИсходныеНормыВыдачиСИЗ/ИсходныеНормыВыдачиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсходныеНормыВыдачиСИЗ</name>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаАСТБ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УсловиеНормы</name>
    <type>
      <types>CatalogRef.УсловияНорм</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаВыдачи</name>
    <type>
      <types>CatalogRef.НормыВыдачиСИЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/DataProcessors/СозданиеНормВыдачиСИЗ/Forms/ФормаВводаНаОсновании/Module.bsl
&НаСервере
Функция ОКНаСервере()
	
	ТаблицаДляЗаписи = РеквизитФормыВЗначение("НормыВыдачи");
	
	НаборЗаписей = РегистрыСведений.ИсходныеНормыВыдачиСИЗ.СоздатьНаборЗаписей();
	
	Для Каждого СтрокаТаблицыДляЗаписи Из ТаблицаДляЗаписи Цикл
	
		НоваяЗапись 				= НаборЗаписей.Добавить();
		НоваяЗапись.Организация 	= Организация;
		НоваяЗапись.Подразделение	= Подразделение;
		НоваяЗапись.Должность		= Должность;
		НоваяЗапись.РабочееМесто	= РабочееМесто;
		НоваяЗапись.УсловиеНормы	= УсловиеНормы;
		НоваяЗапись.Использовать	= Использовать;
		НоваяЗапись.НормаВыдачи 	= СтрокаТаблицыДляЗаписи.НормаВыдачи;
		
	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать(Ложь);
	    Возврат Истина;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	
	ЗаписьПрошлаУспешно = ОКНаСервере();
	
	Если ЗаписьПрошлаУспешно Тогда
		Закрыть(КодВозвратаДиалога.ОК);
	    ОповеститьОВыборе(ЗаписьПрошлаУспешно);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация 		= Параметры.Организация;
	Подразделение 		= Параметры.Подразделение;
	Должность 			= Параметры.Должность;
	РабочееМесто 		= Параметры.РабочееМесто;
	УсловиеНормы 		= Параметры.УсловиеНормы;
	Использовать 		= Параметры.Использовать;
	ТаблицаНормВыдачи 	= ПолучитьИзВременногоХранилища(Параметры.АдресВременногоХранилищаТаблицы);
	
	ЗначениеВРеквизитФормы(ТаблицаНормВыдачи,"НормыВыдачи");
	
	ЭтаФорма.Элементы.РабочееМесто.Видимость = Организация.ИспользоватьРабочиеМеста;
	
КонецПроцедуры
